OpenFOAM-11/tutorials/multiRegion/CHT/shellAndTubeHeatExchanger/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh.layers

runParallel $(getApplication)

runApplication reconstructPar -allRegions

paraFoam -touchAll
